/* Scope Bar Protection Group */
"scopeBarProtectionGroup" = "保护：";

/* Scope Bar Protection All */
"scopeBarProtectionAllItem" = "全部";

/* Scope Bar Protection Write */
"scopeBarProtectionWriteItem" = "写入";

/* Scope Bar Protection Execute */
"scopeBarProtectionExecuteItem" = "执行";

/* Scope Bar Qualifier Group */
"scopeBarQualifierGroup" = "限定符：";

/* Scope Bar Qualifier Signed */
"scopeBarQualifierSignedItem" = "有符号";

/* Scope Bar Qualifier Unsigned */
"scopeBarQualifierUnsignedItem" = "无符号";

/* Scope Bar Matching Group */
"scopeBarStringMatchingGroup" = "匹配：";

/* Scope Bar Matching Ignore Case */
"scopeBarStringMatchingIgnoreCaseItem" = "忽略大小写";

/* Scope Bar Matching Null Terminated */
"scopeBarStringMatchingNullTerminatedItem" = "以空字符结尾";

/* Scope Bar Endianness Group */
"scopeBarEndiannessGroup" = "字节序：";

/* Scope Bar Little Endian */
"scopeBarEndianLittleItem" = "小端";

/* Scope Bar Big Endian */
"scopeBarEndianBigItem" = "大端";

/* Scope Bar accessory for Below label when doing > value search; also used for error reporting */
"searchBelowLabel" = "下限";

/* Scope Bar accessory for Above label when doing < value search; also used for error reporting */
"searchAboveLabel" = "上限";

/* Scope Bar accessory for Round Error label when doing = or != float/double value search; also used for error reporting */
"searchRoundErrorLabel" = "舍入误差";

/* Equals Operator Title */
"equalsOperatorTitle" = "等于";

/* Not Equals Operator Title */
"notEqualsOperatorTitle" = "不等于";

/* Greater Than Operator Title */
"greaterThanOperatorTitle" = "大于";

/* Less Than Operator Title */
"lessThanOperatorTitle" = "小于";

/* Undo Data Type Change Action */
"undoDataTypeChangeAction" = "更改数据类型";

/* Clear Search Variables Action Menu Item Title */
"clearSearchVariablesTitle" = "清除搜索变量";

/* Clear Variables Action Menu Item Title */
"clearVariablesTitle" = "清除变量";

/* Freeze single variable menu item title */
"freezeSingleVariableTitle" = "冻结变量";

/* Freeze muitiple variables menu item title */
"freezeMulitipleVariablesTitle" = "冻结变量";

/* Unfreeze single variable menu item title */
"unfreezeSingleVariableTitle" = "解冻变量";

/* Unfreeze muitiple variables menu item title */
"unfreezeMultipleVariablesTitle" = "解冻变量";

/* Edit single variable value menu item title */
"editSingleVariableValueTitle" = "编辑变量值…";

/* Edit multiple variable values menu item title */
"editMultipleVariableValuesTitle" = "编辑变量值…";

/* Edit single variable label menu item title */
"editSingleVariableLabelTitle" = "编辑变量标签…";

/* Edit multiple variable labels menu item title */
"editMultipleVariableLabelsTitle" = "编辑变量标签…";

/* Edit single variable size menu item title */
"editSingleVariableSizeTitle" = "编辑变量大小…";

/* Edit multiple variable sizes menu item title */
"editMultipleVariableSizesTitle" = "编辑变量大小…";

/* Relativize single variable menu item title */
"relativizeSingleVariableTitle" = "相对化变量";

/* Relativize multiple variables menu item title */
"relativizeMultipleVariablesTitle" = "相对化变量";

/* Watch Write Accesses */
"watchAccesses_0_0" = "监视写入访问…";

/* Watch Write Accesses to Base Address */
"watchAccesses_0_1" = "监视对基址的写入访问…";

/* Watch Read & Write Accesses */
"watchAccesses_1_0" = "监视读取和写入访问…";

/* Watch Read & Write Accesses to Base Address */
"watchAccesses_1_1" = "监视对基址的读取和写入访问…";

/* NOP single variable menu item title */
"nopSingleVariableTitle" = "NOP 化变量";

/* NOP multiple variables menu item title */
"nopMultipleVariablesTitle" = "NOP 化变量";

/* Previous Operator menu item title */
"previousOperatorMenuItem" = "上一个运算符";

/* Next Operator menu item title */
"nextOperatorMenuItem" = "下一个运算符";

/* Toggle Search Type menu item title */
"toggleSearchTypeMenuItem" = "切换搜索类型";

/* Title of Stored Value menu item in search menu of the search field */
"storedValueTokenTitle" = "已存储的值";

/* Name of Stored Value Token in search field */
"storedValueTokenName" = "$StoredValue";

/* Tool tip for Store Values button */
"storeValuesButtonToolTip" = "存储目标进程当前的所有值，以便之后根据这些值的变化进行搜索";

/* Alert Title that no Stored Values are available when searching with a stored value token */
"noStoredValuesAlertTitle" = "没有可用的已存储值";

/* Alert Message that no Stored Values are available when searching with a stored value token */
"noStoredValuesAlertMessage" = "没有可供比较的已存储值。请先存储值后再继续。";

/* Search Finished Notification Title */
"searchFinishedNotificationTitle" = "搜索完成";

/* Undo action name for a Search */
"undoSearchAction" = "搜索";

/* Label title for Beginning Address field */
"beginningAddressLabel" = "起始地址";

/* Label title for Ending Address field */
"endingAddressLabel" = "结束地址";

/* Error Message format when Above, Below, Round Error, Beginning Address, Ending Address fields have invalid input */
"invalidFlagsFieldErrorMessageFormat" = "「%@」 对应的值需要是有效的表达式或留空。";

/* Error Message for when Beginning Address >= Ending Address */
"endingAddressIsNotGreaterThanBeginningAddressErrorMessage" = "起始地址字段中的值必须小于结束地址字段中的值，或者可以省略其中一个或两个字段。";

/* Error Message for when trying address type search for 32-bit targets */
"addressTypeNotSupportedFor32Bit" = "不支持在 32 位目标中搜索内存地址。";

/* Error Message for when trying address type search for all numbers */
"addressTypeNotSupportedForAllNumbers" = "“所有数值”不支持搜索内存地址。请改为选择被指向值的数据类型。";

/* Error Message for when trying address type search for 32-bit and 64-bit integers */
"addressTypeNotSupportedFor32And64BitIntegers" = "“32/64 位整数”不支持搜索内存地址。请改为选择被指向值的数据类型。";

/* Error Message for when the offset value cannot be parsed */
"addressTypeIndirectOffsetParseError" = "无法解析偏移值。";

/* Error message for when the selected data type to seach is a numerical one, and the expression cannot be parsed */
"invalidNumericalSearchExpressionErrorMessage" = "搜索值不是有效的数值表达式。";

/* Error message for when searching 32-bit and 64-bit integers, and they can't hold the numbers being searched for */
"numbersNotHeldBy32And64BitIntegersErrorMessage" = "要搜索的数值无法用 32 位或 64 位整数表示。只能搜索整数，且搜索无符号整数时不能为负数。";

/* Error Message when attempting to do stored value byte array search */
"storedValueSearchUnsupportedForByteArrays" = "字节数组不支持与已存储值比较";

/* Error Message when attempting to do stored value strings search */
"storedValueSearchUnsupportedForStrings" = "字符串不支持与已存储值比较";

/* Error Message when failing to parse a linear stored value expression */
"linearExpressionParseFailureErrorMessage" = "无法正确解析搜索表达式。请尝试更简单的表达式。";

/* Generic Error Alert Title for when a field could not be parsed properly */
"invalidSearchInputAlertTitle" = "搜索输入无效";

/* Label for when search is being cancelled */
"cancelingSearchStatusLabel" = "正在取消搜索…";

/* Label for when Storing Values is being cancelled */
"cancelingStoringValuesStatusLabel" = "正在取消存储值…";

/* Label for Storing all Values operation is occuring */
"storingValuesStatusLabel" = "正在存储所有值…";

/* Alert Title indicating that searching is failing */
"searchFailureAlertTitle" = "搜索失败";

/* Alert Message indicating that searching is failing due to system protections */
"searchFailureSystemProtectionAlertMessageFormat" = "由于系统保护，无法搜索 %@ 的内存。";

/* Alert Message indicating that searching is failing due to the target runnning with elevated privileges */
"searchFailureElevatedPrivilegesAlertMessageFormat" = "%@ 无法被搜索，可能因为它以提升的权限运行。";

/* Alert Message indicating that searching is failing because the target is an iOS App Store app */
"searchFailureIOSAppAlertMessageFormat" = "%@ 无法被搜索，因为 iOS App Store 应用无法被调试。";
